Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dlq_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dlq_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowLambdaServiceToSendMessage"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_dashboard.lambdas_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "lambdas_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "LambdaDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_dashboard.step_functions_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "StepFunctionsDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_event_rule.workflow_schedule must be replaced
-/+ resource "aws_cloudwatch_event_rule" "workflow_schedule" {
      ~ arn                 = "arn:aws:events:us-east-2:481665084477:rule/anime_workflow_schedule" -> (known after apply)
      ~ id                  = "anime_workflow_schedule" -> (known after apply)
      - is_enabled          = true -> null
      ~ name                = "anime_workflow_schedule" -> "animeutopia_workflow_schedule" # forces replacement
      + name_prefix         = (known after apply)
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      ~ tags_all            = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.state_machine_target must be replaced
-/+ resource "aws_cloudwatch_event_target" "state_machine_target" {
      ~ arn            = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow" -> (known after apply)
      ~ id             = "anime_workflow_schedule-StepFunctionStateMachine" -> (known after apply)
      ~ role_arn       = "arn:aws:iam::481665084477:role/eventbridge_step_functions_role" -> (known after apply)
      ~ rule           = "anime_workflow_schedule" -> "animeutopia_workflow_schedule" # forces replacement
      ~ target_id      = "StepFunctionStateMachine" -> "animeutopia_StepFunctionStateMachine" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.automated_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "automated_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/automated_workfloww"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
    }

  # aws_cloudwatch_log_group.fetch_data_log_group will be created
+ resource "aws_cloudwatch_log_group" "fetch_data_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fetch_data"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
    }

  # aws_cloudwatch_log_group.notify_post_log_group will be created
+ resource "aws_cloudwatch_log_group" "notify_post_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/notify_post"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
    }

  # aws_cloudwatch_log_group.sns_to_teams_log_group will be created
+ resource "aws_cloudwatch_log_group" "sns_to_teams_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sns_to_teams"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_aborts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_aborts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if the automated Step Function is aborted within a 5-minute window."
      + alarm_name                            = "animeutopia-automated-workflow-aborts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsAborted"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_failures will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if the automated Step Function fails within a 5-minute window."
      + alarm_name                            = "animeutopia-automated-workflow-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsFailed"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_timeouts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_timeouts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if the automated Step Function times out within a 5-minute window."
      + alarm_name                            = "animeutopia-automated-workflow-timeouts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsTimedOut"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate function average duration exceeds 3s in a 5-minute window."
      + alarm_name                            = "animeutopia-check_duplicate-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 3000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate function returns any errors in a 5-minute window."
      + alarm_name                            = "animeutopia-check_duplicate-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate invocations deviate from normal"
      + alarm_name                            = "animeutopia-check-duplicate-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "CheckDuplicateInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "check_duplicate"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate memory usage exceeds 500 MB in a 5-minute window."
      + alarm_name                            = "animeutopia-check_duplicate-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 500
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.dlq_alarm will be created
+ resource "aws_cloudwatch_metric_alarm" "dlq_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers if there are any messages in the DLQ."
      + alarm_name                            = "animeutopia-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "animeutopia-lambda-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data function average duration exceeds 4s in a 5-minute window."
      + alarm_name                            = "animeutopia-fetch_data-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 4000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data function returns any errors in a 5-minute window."
      + alarm_name                            = "animeutopia-fetch-data-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data invocations deviate from normal"
      + alarm_name                            = "animeutopia-fetch-data-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "FetchDataInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "fetch_data"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.fetch_data_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data memory usage exceeds 900 MB in a 5-minute window."
      + alarm_name                            = "animeutopia-fetch_data-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 900
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post function average duration exceeds 2s in a 5-minute window."
      + alarm_name                            = "animeutopia-notify_post-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 2000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post function returns any errors in a 5-minute window."
      + alarm_name                            = "animeutopia-notify_post-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post invocations deviate from normal"
      + alarm_name                            = "animeutopia-notify-post-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "NotifyPostInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "notify_post"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.notify_post_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post memory usage exceeds 300 MB in a 5-minute window."
      + alarm_name                            = "animeutopia-notify_post-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold                             = 300
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sns_to_teams_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "sns_to_teams_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if sns_to_teams invocations deviate from normal"
      + alarm_name                            = "animeutopia-sns-to-teams-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "SnsToTeamsInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "sns_to_teams"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_efs_access_point.lambda_ap will be destroyed
  # (because aws_efs_access_point.lambda_ap is not in configuration)
- resource "aws_efs_access_point" "lambda_ap" {
      - arn             = "arn:aws:elasticfilesystem:us-east-2:481665084477:access-point/fsap-0191ef7595cace3d5" -> null
      - file_system_arn = "arn:aws:elasticfilesystem:us-east-2:481665084477:file-system/fs-0aff801cffc9657e7" -> null
      - file_system_id  = "fs-0aff801cffc9657e7" -> null
      - id              = "fsap-0191ef7595cace3d5" -> null
      - owner_id        = "481665084477" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "DeployedBy" = "Terraform"
        } -> null

      - posix_user {
          - gid            = 1000 -> null
          - secondary_gids = [] -> null
          - uid            = 1000 -> null
        }

      - root_directory {
          - path = "/lambda" -> null

          - creation_info {
              - owner_gid   = 1000 -> null
              - owner_uid   = 1000 -> null
              - permissions = "755" -> null
            }
        }
    }

  # aws_efs_file_system.lambda_efs will be destroyed
  # (because aws_efs_file_system.lambda_efs is not in configuration)
- resource "aws_efs_file_system" "lambda_efs" {
      - arn                             = "arn:aws:elasticfilesystem:us-east-2:481665084477:file-system/fs-0aff801cffc9657e7" -> null
      - creation_token                  = "lambda-efs" -> null
      - dns_name                        = "fs-0aff801cffc9657e7.efs.us-east-2.amazonaws.com" -> null
      - encrypted                       = false -> null
      - id                              = "fs-0aff801cffc9657e7" -> null
        name                            = null
      - number_of_mount_targets         = 1 -> null
      - owner_id                        = "481665084477" -> null
      - performance_mode                = "generalPurpose" -> null
      - provisioned_throughput_in_mibps = 0 -> null
      - size_in
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.